import tea from '../assets/Images/teagreen.png';
import flower from "..//assets/Images/Flower.png"
export const mock = [
    {
        image: tea,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: tea,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: tea,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: tea,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: tea,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: tea,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    }
]
export const mock2 = [
    {
        image: flower,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: flower,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: flower,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: flower,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: flower,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: flower,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    }
]