import tea from '../assets/Images/teagreen.png';

export const mock = [
    {
        image: tea,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: tea,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: tea,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: tea,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: tea,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: tea,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    }
]