import tea from '../assets/Images/teagreen.png';
import flower from "..//assets/Images/Flower.png"
import {Good, StrelkaVniz} from "../ui-kit/icons";
export const mock = [
    {
        image: tea,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: tea,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: tea,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: tea,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: tea,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: tea,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    }
]
export const mock2 = [
    {
        image: flower,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: flower,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: flower,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: flower,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: flower,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    },
    {
        image: flower,
        title: 'Чай черный',
        description: 'Наша дружелюбная команда с удовольствием поможет вам выбрать именно тот чай, который подходит вам.',
        price: '24.50 Lei',

    }
]

export const mock3 = [
    {id: 0, title: 'Выгодня цена', icon: <Good/>, value: 'favorible_price'},
    {id: 1, title: 'Дешевле', icon: <StrelkaVniz/>, value: 'less_expensive'},
]